# import numpy as np

In [3]:
import pandas as pd
import numpy as np

In [20]:
from numpy.random import randn
np.random.seed(101)

In [21]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [31]:
df[['Y','Z']]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
type(df['X'])

pandas.core.series.Series

In [36]:
df['New_column'] = df['Y']-df['X']

In [38]:
df['New_column']

A    0.279837
B   -0.528759
C   -0.211309
D   -0.174365
E    0.627210
Name: New_column, dtype: float64

In [43]:
df

          W         X         Y         Z  New_column
A  2.706850  0.628133  0.907969  0.503826    0.279837
B  0.651118 -0.319318 -0.848077  0.605965   -0.528759
C -2.018168  0.740122  0.528813 -0.589001   -0.211309
D  0.188695 -0.758872 -0.933237  0.955057   -0.174365
E  0.190794  1.978757  2.605967  0.683509    0.627210

In [47]:
df.drop('New_column',axis=1)  # Not inplace unless specified! df.drop('new',axis=1,inplace=True)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
df

          W         X         Y         Z  New_column
A  2.706850  0.628133  0.907969  0.503826    0.279837
B  0.651118 -0.319318 -0.848077  0.605965   -0.528759
C -2.018168  0.740122  0.528813 -0.589001   -0.211309
D  0.188695 -0.758872 -0.933237  0.955057   -0.174365
E  0.190794  1.978757  2.605967  0.683509    0.627210

In [50]:
df.drop('New_column',axis=1,inplace=True)

In [51]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [55]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [56]:
df.iloc[0]    #Access group of rows and columns by integer position(s).

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [62]:
df.xs('X',axis=1)

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [63]:
df.loc['B','Y']   #Subsetssssssss

-0.8480769834036315

In [64]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [65]:
#Conditional subset

In [69]:
df>1

       W      X      Y      Z
A   True  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [70]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
#Index playground
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [73]:
states = 'CA NY WY OR CO'.split()

In [74]:
states

['CA', 'NY', 'WY', 'OR', 'CO']

In [75]:
df['states']=states

In [76]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [78]:
df.set_index('states')

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [79]:
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [81]:
df.set_index('states',inplace=True)

In [82]:
df

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [84]:
    import numpy as np
    import pandas as pd

In [85]:
labels ={'a','b','c','d'}

In [86]:
labels

{'a', 'b', 'c', 'd'}

In [87]:
my_list = [10,23,13,21]

In [88]:
np.array(my_list)

array([10, 23, 13, 21])

In [91]:
dict ={'a':10,'b':20,'c':30,'d':40}

In [92]:
pd.Series(dict)  #Convert Dict to series Series can have axis labels, meaning it can be indexed by a label,(all objects)

a    10
b    20
c    30
d    40
dtype: int64

In [94]:
pd.Series(my_list,index=labels)

b    10
a    23
c    13
d    21
dtype: int64

In [96]:
pd.Series(my_list)   #Auto indexing

0    10
1    23
2    13
3    21
dtype: int64

In [97]:
pd.Series(dict)

a    10
b    20
c    30
d    40
dtype: int64

In [98]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [107]:
ser1 = pd.Series([1,2,3,4],index = ['BLR', 'PUN','MUM', 'DEL'])

In [108]:
ser1

BLR    1
PUN    2
MUM    3
DEL    4
dtype: int64

In [109]:
ser2 = pd.Series([1,2,5,10],index = ['BLR', 'PUN','DEL', 'JBP'])

In [110]:
ser2

BLR     1
PUN     2
DEL     5
JBP    10
dtype: int64

In [111]:
ser1+ser2   #Based on the index calculation happening if BLR==BLR then only addition else NaN

BLR    2.0
DEL    9.0
JBP    NaN
MUM    NaN
PUN    4.0
dtype: float64

# Missing Data

In [112]:
import numpy as np
import pandas as pd

In [115]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]})

In [116]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [117]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [124]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [125]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [126]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [127]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [128]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

# Groupby

In [146]:
import pandas as pd
# Create dataframe
data = {'Company':['NC','CG','NC','TFC','CG','TFC'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [147]:
data

{'Company': ['NC', 'CG', 'NC', 'TFC', 'CG', 'TFC'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [148]:
df = pd.DataFrame(data)

In [149]:
df

  Company   Person  Sales
0      NC      Sam    200
1      CG  Charlie    120
2      NC      Amy    340
3     TFC  Vanessa    124
4      CG     Carl    243
5     TFC    Sarah    350

In [150]:
df.groupby('Company')

In [151]:
by_comp = df.groupby("Company")

In [152]:
by_comp.mean()

         Sales
Company
CG       181.5
NC       270.0
TFC      237.0

In [154]:
by_comp.std()   #standard deviation https://www.mathsisfun.com/data/standard-normal-distribution.html

              Sales
Company
CG        86.974134
NC        98.994949
TFC      159.806133

In [155]:
by_comp.min()

        Person  Sales
Company
CG        Carl    120
NC         Amy    200
TFC      Sarah    124

In [156]:
by_comp.median()

         Sales
Company
CG       181.5
NC       270.0
TFC      237.0

In [157]:
by_comp.max()

          Person  Sales
Company
CG       Charlie    243
NC           Sam    340
TFC      Vanessa    350

In [161]:
by_comp.count()

         Person  Sales
Company
CG            2      2
NC            2      2
TFC           2      2

In [163]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
CG        2.0  181.5   86.974134  120.0  150.75  181.5  212.25  243.0
NC        2.0  270.0   98.994949  200.0  235.00  270.0  305.00  340.0
TFC       2.0  237.0  159.806133  124.0  180.50  237.0  293.50  350.0

In [164]:
by_comp.describe().transpose()

Company              CG          NC         TFC
Sales count    2.000000    2.000000    2.000000
      mean   181.500000  270.000000  237.000000
      std     86.974134   98.994949  159.806133
      min    120.000000  200.000000  124.000000
      25%    150.750000  235.000000  180.500000
      50%    181.500000  270.000000  237.000000
      75%    212.250000  305.000000  293.500000
      max    243.000000  340.000000  350.000000

In [165]:
by_comp.describe().transpose()['CG']

Sales  count      2.000000
       mean     181.500000
       std       86.974134
       min      120.000000
       25%      150.750000
       50%      181.500000
       75%      212.250000
       max      243.000000
Name: CG, dtype: float64

# Merging, Joining, and Concatenating

In [166]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [167]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [168]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [170]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [172]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [173]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [178]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [179]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [180]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

In [181]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [182]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [183]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [187]:
pd.concat(left,right,how='inner',on='key')   //will not work like that :P

TypeError: concat() got an unexpected keyword argument 'how'

In [192]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
####MERGE work like SQL Join#####

In [193]:
Signature:
pd.merge(
    ['left', 'right', "how='inner'", 'on=None', 'left_on=None', 'right_on=None', 'left_index=False', 'right_index=False', 'sort=False', "suffixes=('_x', '_y')", 'copy=True', 'indicator=False', 'validate=None'],
)
Docstring:
Merge DataFrame objects by performing a database-style join operation by
columns or indexes.

If joining columns on columns, the DataFrame indexes *will be
ignored*. Otherwise if joining indexes on indexes or indexes on a column or
columns, the index will be passed on.

Parameters
----------
left : DataFrame
right : DataFrame
how : {'left', 'right', 'outer', 'inner'}, default 'inner'
    * left: use only keys from left frame, similar to a SQL left outer join;
      preserve key order
    * right: use only keys from right frame, similar to a SQL right outer join;
      preserve key order
    * outer: use union of keys from both frames, similar to a SQL full outer
      join; sort keys lexicographically
    * inner: use intersection of keys from both frames, similar to a SQL inner
      join; preserve the order of the left keys


Examples
--------

>>> A              >>> B
    lkey value         rkey value
0   foo  1         0   foo  5
1   bar  2         1   bar  6
2   baz  3         2   qux  7
3   foo  4         3   bar  8

>>> A.merge(B, left_on='lkey', right_on='rkey', how='outer')
   lkey  value_x  rkey  value_y
0  foo   1        foo   5
1  foo   4        foo   5
2  bar   2        bar   6
3  bar   2        bar   8
4  baz   3        NaN   NaN
5  NaN   NaN      qux   7

SyntaxError: invalid syntax (<ipython-input-193-2030c9baa7b1>, line 1)

In [195]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [196]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2